{"by":"cotelletta","id":19470050,"kids":[19470223],"parent":19464269,"text":"A while back I saw a coworker virtue signal about the parallels between tech and nursing. There were gender problems in both, and it was the same cause, he said.<p>Except, it&#x27;s not the same cause at all, it&#x27;s just the same blame. Watch:<p>Not enough women in tech: &quot;men, it&#x27;s your fault, stop being so crude and competitive. Change your working style to suit and attract women. Stop making crude jokes and having arguments.&quot;<p>Not enough men in nursing: &quot;men, it&#x27;s your fault, stop being such cowards who think a social job is not manly. Don&#x27;t listen to your friends if they mock you, it&#x27;s toxic masculinity.&quot;<p>What would actually be equality is if the first was paired with:<p>&quot;Women nurses, stop being so catty and learn to be more stoic to attract men in the workplace. Change your habits and social style to be more factual and problem oriented.&quot;<p>Or the second paired with:<p>&quot;Women in tech, stop listening to your girlfriends who think tech is not glamorous and cute. Value your own self worth and improve your self sufficiency. Don&#x27;t be a mean girl.&quot;<p>The fact that this very simple gender swap is treated as invalid demonstrates how intellectually bankrupt the diversity movement is. Their justifications only come after the fact, after they&#x27;ve already decided who qualifies for sympathy and victimhood, and who doesn&#x27;t.<p>Despite all this concern about subtle implicit bias, about societal pressure and messages invisibly reinforced by society... Somehow gender studies experts have still not noticed that some of the most implicitly gendered terms are expectations that only men are meant to live up to: to not be a coward and not be a creep.<p>If a woman values her own comfort and safety over self sacrificing? That does not make her a coward. If a woman expects to be welcomed and to be able to join a social interaction a priori? Not entitlement, not creepy.<p>50 years of gender studies, and society is only more willing to entertain such pandering and double standards at the expense of men.<p>H L Mencken was right: men are stupid because they actually think concepts like honor and duty are real, instead of just a stick used to shame them into submission.<p>No thank you. &quot;Historically marginalized&quot; and &quot;traditionally underrepresented&quot; is a giant excuse built upon the soft bigotry of low expectations. The only people consistently marginalized have been the poor, and I&#x27;ve never seen more spoiled, clueless, unaware adults than at &quot;diverse&quot; tech events.","time":1553341517,"type":"comment","createdOn":"2021-12-14T10:33:49.488","ttl":600}